
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: Blueprints
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: Indiana

#pragma pack(push, 0x1)

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_HDFEngineer.INX2_T_07_HDFEngineer_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_HDFEngineer_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/Factions/INX2_SLUG.INX2_SLUG_C
/// Size: 0x0200 (512 bytes) (0x000200 - 0x000200) align 8 MaxSize: 0x0200
class UINX2_SLUG_C : public UFactionData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/Factions/INX2_Rizzo.INX2_Rizzo_C
/// Size: 0x0200 (512 bytes) (0x000200 - 0x000200) align 8 MaxSize: 0x0200
class UINX2_Rizzo_C : public UFactionData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/Factions/INX2_HappyDaleFarms.INX2_HappyDaleFarms_C
/// Size: 0x0200 (512 bytes) (0x000200 - 0x000200) align 8 MaxSize: 0x0200
class UINX2_HappyDaleFarms_C : public UFactionData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/INX2_TEAM_OrchardSwarms.INX2_TEAM_OrchardSwarms_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_OrchardSwarms_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/INX2_TEAM_OrchardExterminators.INX2_TEAM_OrchardExterminators_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_OrchardExterminators_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Interior/INX2_TEAM_HDFSurvivors.INX2_TEAM_HDFSurvivors_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_HDFSurvivors_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_TEAM_HDF_ExteriorBots.INX2_TEAM_HDF_ExteriorBots_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_HDF_ExteriorBots_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_TEAM_BlueChipMercenaries.INX2_TEAM_BlueChipMercenaries_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_BlueChipMercenaries_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_GlacialAgents.INX2_T_GlacialAgents_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_GlacialAgents_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_SecureStorage.INX2_T_10_SecureStorage_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_SecureStorage_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_RachelMeyer.INX2_T_10_RachelMeyer_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_RachelMeyer_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_OsmondReynolds.INX2_T_10_OsmondReynolds_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_OsmondReynolds_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_OsmondGuards.INX2_T_10_OsmondGuards_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_OsmondGuards_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_MarvinBrandt.INX2_T_10_MarvinBrandt_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_MarvinBrandt_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_LazyCows.INX2_T_10_LazyCows_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_LazyCows_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_10_HoraceNelson.INX2_T_10_HoraceNelson_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_10_HoraceNelson_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_T_0803_Scientists.INX2_T_0803_Scientists_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_0803_Scientists_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_YPH_OldMan.INX2_T_07_YPH_OldMan_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_YPH_OldMan_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INx2_T_07_YPH_Exec.INX2_T_07_YPH_Exec_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_YPH_Exec_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_WildernessTourists.INX2_T_07_WildernessTourists_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_WildernessTourists_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_SLUGHunters.INX2_T_07_SLUGHunters_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_SLUGHunters_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_MilkingCanids.INX2_T_07_MilkingCanids_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_MilkingCanids_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_MilkingAutoMechanical.INX2_T_07_MilkingAutoMechanical_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_MilkingAutoMechanical_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_GuruDisciples.INX2_T_07_GuruDisciples_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_GuruDisciples_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Wilderness/INX2_T_07_AoG_WildernessOutlaws.INX2_T_07_AoG_WildernessOutlaws_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_07_AoG_WildernessOutlaws_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_Townies.INX2_T_06_Townies_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_Townies_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_Thugs.INX2_T_06_Thugs_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_Thugs_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_SLUGTownies.INX2_T_06_SLUGTownies_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_SLUGTownies_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_SIM.INX2_T_06_SIM_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_SIM_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_Sedrick.INX2_T_06_Sedrick_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_Sedrick_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_06_Robots.INX2_T_06_Robots_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_06_Robots_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_0602_Warehouse.INX2_T_0602_Warehouse_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_0602_Warehouse_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/06_Docks/INX2_T_0602_SOUS.INX2_T_0602_SOUS_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_0602_SOUS_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_Burbage.INX2_T_Burbage_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Burbage_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_Bertie.INX2_T_Bertie_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Bertie_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_05_SLUG.INX2_T_05_SLUG_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_05_SLUG_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_05_Raptidons.INX2_T_05_Raptidons_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_05_Raptidons_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/10_HDF/Exterior/INX2_T_HDF_Employees.INX2_T_HDF_Employees_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_HDF_Employees_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_TEAM_0108_SLUG_Killsquad.INX2_TEAM_0108_SLUG_Killsquad_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0108_SLUG_Killsquad_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_TEAM_0108_SLUG.INX2_TEAM_0108_SLUG_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0108_SLUG_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_TEAM_0108_Orchard_Employees.INX2_TEAM_0108_Orchard_Employees_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0108_Orchard_Employees_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_TEAM_0108_Maze.INX2_TEAM_0108_Maze_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0108_Maze_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_TEAM_0108_Exterminator_Bots.INX2_TEAM_0108_Exterminator_Bots_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0108_Exterminator_Bots_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_T_Primal_Drunk.INX2_T_Primal_Drunk_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Primal_Drunk_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/08_Orchard/INX2_T_Mazebot.INX2_T_Mazebot_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Mazebot_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/07_Botanic_Lab/INX2_TEAM_0701_CarrieHobbs.INX2_TEAM_0701_CarrieHobbs_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_0701_CarrieHobbs_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_Hotel_Rizzo.INX2_T_Hotel_Rizzo_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Hotel_Rizzo_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/05_Hotel/INX2_T_Hotel_Guests.INX2_T_Hotel_Guests_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Hotel_Guests_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_Pilothouse_Tourist.INX2_T_Pilothouse_Tourist_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Pilothouse_Tourist_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_Pilothouse_GuardRizzo.INX2_T_Pilothouse_GuardRizzo_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Pilothouse_GuardRizzo_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_Pilothouse_Engineer.INX2_T_Pilothouse_Engineer_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Pilothouse_Engineer_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_11_Shoppers.INX2_T_11_Shoppers_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_11_Shoppers_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_11_AmitaOnly.INX2_T_11_AmitaOnly_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_11_AmitaOnly_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/Parasites/INX2_TEAM_Parasites.INX2_TEAM_Parasites_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_TEAM_Parasites_C : public UT_Generic_Hostile_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/03_DST/03_T_Slug.03_T_Slug_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class U03_T_Slug_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/03_DST/03_T_Admin.03_T_Admin_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class U03_T_Admin_C : public UT_Generic_Neutral_C
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Teams/02_Pilothouse/INX2_T_Pilothouse_Helen.INX2_T_Pilothouse_Helen_C
/// Size: 0x0238 (568 bytes) (0x000238 - 0x000238) align 8 MaxSize: 0x0238
class UINX2_T_Pilothouse_Helen_C : public UTeamData
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Spells/FlawEffects/INX2_Spell_Flaw_WormedOut.INX2_Spell_Flaw_WormedOut_C
/// Size: 0x0190 (400 bytes) (0x000190 - 0x000190) align 16 MaxSize: 0x0190
class UINX2_Spell_Flaw_WormedOut_C : public USpell
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Flaws/INX2_Flaw_Sys_WormedOut.INX2_Flaw_Sys_WormedOut_C
/// Size: 0x0088 (136 bytes) (0x000088 - 0x000088) align 8 MaxSize: 0x0088
class UINX2_Flaw_Sys_WormedOut_C : public UFlaw
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Spells/FlawEffects/INX2_Spell_Flaw_PhobiaParasite.INX2_Spell_Flaw_PhobiaParasite_C
/// Size: 0x0190 (400 bytes) (0x000190 - 0x000190) align 16 MaxSize: 0x0190
class UINX2_Spell_Flaw_PhobiaParasite_C : public USpell
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Flaws/INX2_Flaw_Sys_PhobiaParasite.INX2_Flaw_Sys_PhobiaParasite_C
/// Size: 0x0088 (136 bytes) (0x000088 - 0x000088) align 8 MaxSize: 0x0088
class UINX2_Flaw_Sys_PhobiaParasite_C : public UFlaw
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/StatusEffects/INX2_CE_BrownVodkaWillies.INX2_CE_BrownVodkaWillies_C
/// Size: 0x01B8 (440 bytes) (0x0001B8 - 0x0001B8) align 8 MaxSize: 0x01B8
class UINX2_CE_BrownVodkaWillies_C : public UMultiStatusEffect
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/StatusEffects/INX2_CE_BrownVodkaBlues.INX2_CE_BrownVodkaBlues_C
/// Size: 0x01B8 (440 bytes) (0x0001B8 - 0x0001B8) align 8 MaxSize: 0x01B8
class UINX2_CE_BrownVodkaBlues_C : public UMultiStatusEffect
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaYellow.Drink_Rizzo_SpectrumVodkaYellow_C
/// Size: 0x0238 (568 bytes) (0x000230 - 0x000238) align 8 MaxSize: 0x0238
class UDrink_Rizzo_SpectrumVodkaYellow_C : public UConsumableItem
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0230   (0x0008)  


	/// Functions
	// Function /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaYellow.Drink_Rizzo_SpectrumVodkaYellow_C.SetObjective
	// void SetObjective(class AActor* Objective, FString ObjectiveName);                                                       // [0x1c5deb0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaYellow.Drink_Rizzo_SpectrumVodkaYellow_C.ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow
	// void ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow(int32_t EntryPoint);                                               // [0x1c5deb0] Final                
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaViolet.Drink_Rizzo_SpectrumVodkaViolet_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaViolet_C : public UConsumableItem
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaOrange_C.Drink_Rizzo_SpectrumVodkaOrange_C_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaOrange_C_C : public UConsumableItem
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaIndigo.Drink_Rizzo_SpectrumVodkaIndigo_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaIndigo_C : public UConsumableItem
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaGreen.Drink_Rizzo_SpectrumVodkaGreen_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaGreen_C : public UConsumableItem
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaBlue.Drink_Rizzo_SpectrumVodkaBlue_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaBlue_C : public UConsumableItem
{ 
public:
};

/// Class /Game/INX2_Content/INX2_Blueprints/Item/Consumable/Drink/Drink_Rizzo_SpectrumVodkaBlack.Drink_Rizzo_SpectrumVodkaBlack_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UDrink_Rizzo_SpectrumVodkaBlack_C : public UConsumableItem
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UINX2_T_07_HDFEngineer_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_SLUG_C) == 0x0200); // 512 bytes (0x000200 - 0x000200)
static_assert(sizeof(UINX2_Rizzo_C) == 0x0200); // 512 bytes (0x000200 - 0x000200)
static_assert(sizeof(UINX2_HappyDaleFarms_C) == 0x0200); // 512 bytes (0x000200 - 0x000200)
static_assert(sizeof(UINX2_TEAM_OrchardSwarms_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_OrchardExterminators_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_HDFSurvivors_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_HDF_ExteriorBots_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_BlueChipMercenaries_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_GlacialAgents_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_SecureStorage_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_RachelMeyer_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_OsmondReynolds_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_OsmondGuards_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_MarvinBrandt_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_LazyCows_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_10_HoraceNelson_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_0803_Scientists_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_YPH_OldMan_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_YPH_Exec_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_WildernessTourists_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_SLUGHunters_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_MilkingCanids_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_MilkingAutoMechanical_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_GuruDisciples_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_07_AoG_WildernessOutlaws_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_Townies_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_Thugs_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_SLUGTownies_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_SIM_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_Sedrick_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_06_Robots_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_0602_Warehouse_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_0602_SOUS_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Burbage_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Bertie_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_05_SLUG_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_05_Raptidons_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_HDF_Employees_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0108_SLUG_Killsquad_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0108_SLUG_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0108_Orchard_Employees_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0108_Maze_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0108_Exterminator_Bots_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Primal_Drunk_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Mazebot_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_0701_CarrieHobbs_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Hotel_Rizzo_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Hotel_Guests_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Pilothouse_Tourist_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Pilothouse_GuardRizzo_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Pilothouse_Engineer_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_11_Shoppers_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_11_AmitaOnly_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_TEAM_Parasites_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(U03_T_Slug_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(U03_T_Admin_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_T_Pilothouse_Helen_C) == 0x0238); // 568 bytes (0x000238 - 0x000238)
static_assert(sizeof(UINX2_Spell_Flaw_WormedOut_C) == 0x0190); // 400 bytes (0x000190 - 0x000190)
static_assert(sizeof(UINX2_Flaw_Sys_WormedOut_C) == 0x0088); // 136 bytes (0x000088 - 0x000088)
static_assert(sizeof(UINX2_Spell_Flaw_PhobiaParasite_C) == 0x0190); // 400 bytes (0x000190 - 0x000190)
static_assert(sizeof(UINX2_Flaw_Sys_PhobiaParasite_C) == 0x0088); // 136 bytes (0x000088 - 0x000088)
static_assert(sizeof(UINX2_CE_BrownVodkaWillies_C) == 0x01B8); // 440 bytes (0x0001B8 - 0x0001B8)
static_assert(sizeof(UINX2_CE_BrownVodkaBlues_C) == 0x01B8); // 440 bytes (0x0001B8 - 0x0001B8)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaYellow_C) == 0x0238); // 568 bytes (0x000230 - 0x000238)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaViolet_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaOrange_C_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaIndigo_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaGreen_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaBlue_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UDrink_Rizzo_SpectrumVodkaBlack_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(offsetof(UDrink_Rizzo_SpectrumVodkaYellow_C, UberGraphFrame) == 0x0230);
